  const qnaList = [
    {
      q: '1. 친구를 사귀었다!',
      a: [
        { answer: 'a. 반가워! 너는 취미가 뭐야?', type: ['gentleman', 'black'] },
        { answer: 'b. 와 신난다! 같이 운동하러 가자!', type: ['cheese', 'fish'] },
        { answer: 'c. 안녕. 잘 지내보자.', type: ['three', 'chaos' ] },
      ]
    },
    {
      q: '2. 길에 뭔가 떨어져 있다!',
      a: [
        { answer: 'a. 궁금한 걸! 가까이 가서 만져봐야지.', type: ['three', 'gentleman', 'black'] },
        { answer: 'b. 뭔진 모르겠지만 위험할 수 있으니 조심해야겠어!', type: ['fish'] },
        { answer: 'c. 뭘까? 먹는 거면 좋겠다!.', type: ['cheese', 'chaos'] },
      ]
    },
    {
      q: '3. 나 때문에 일이 잘못 되었다!',
      a: [
        { answer: 'a. 헤헤~한 번만 봐줘 나 귀엽잖아?', type: ['cheese', 'chaos', 'black'] },
        { answer: 'b. 내가 잘못했을리가! 다시 확인해봐.', type: ['three'] },
        { answer: 'c. 흠, 이건 이렇게 하면 해결할 수 있어!', type: ['gentleman', 'fish'] }
      ]
    },
  ]
  
  const infoList = [
    {
      name: '올블랙',
      desc: '사교적이고 애교 많은 당신! 궁금한 게 있으면 해결해야 하는 호기심 가득한 모습이 올블랙 고양이를 닮았어요.'
    },
    {
      name: '카오스',
      desc: '도도한 매력의 소유자! 보기와 달리 알고 보면 애교쟁이~ 먹는 것에 대한 사랑도 가득한 당신은 카오스 고양이를 닮았어요.'
    },
    {
      name: '치즈',
      desc: '먹는게 제일 좋아! 노는게 제일 좋아! 소년같은 매력에 애교도 가득한 당신은 치즈 고양이를 닮았어요.'
    },
    {
      name: '고등어',
      desc: '다정하고 장난많은 당신! 영리하고 조심성 많은 모습이 고등어 고양이를 닮았어요.'
    },
    {
      name: '턱시도',
      desc: '사교적이고 다정한 당신! 호기심 많고 영리한 모습이 턱시도 고양이를 닮았어요.'
    },
    {
      name: '삼색이',
      desc: '호기심 많은 당신! 도도하고 자존심 강한 모습이 삼색이 고양이를 닮았어요.'
    },
  ]